[
  {
    "id": 1,
    "title": "XStore - Gaming E-commerce Website",
    "desc": "A next-generation gaming e-commerce platform built with Next.js and Tailwind CSS.",
    "img": "https://i.ibb.co/N6Qz9DKW/Screenshot-2025-11-06-181225.png",
    "type": "nextjs",
    "technologies": ["Next.js", "Tailwind CSS", "Swiper.js", "React Icons"],
    "liveUrl": "https://xstore-jet.vercel.app/",
    "githubUrl": "Adityo-dev/xstore",
    "completionDate": "Nov 2025",
    "status": "work in progress",
    "longDescription": "XStore is a modern gaming e-commerce website designed to provide a fast and immersive shopping experience for gamers. The platform allows users to explore, filter, and purchase digital games with a clean and responsive UI. Built using Next.js for lightning-fast rendering and Tailwind CSS for modern styling, it ensures smooth navigation and optimized performance across all devices. Swiper.js adds an interactive and dynamic carousel experience, enhancing product presentation.",
    "challenges": "Ensuring high performance while maintaining visually rich game previews was challenging. Managing image optimization and responsive layouts across multiple device sizes required careful configuration of Next.js image components and lazy loading techniques.",
    "results": "The final product delivers a highly responsive and user-friendly experience with an average page load time under 1 second. The modern design and smooth UI have helped increase user engagement and overall site retention.",
    "images": [
      "https://i.ibb.co/0Vz5D4Kn/image1-5.png",
      "https://i.ibb.co/S7N8gVWX/image1-4.png",
      "https://i.ibb.co/dsgbm3B3/image1-2.png",
      "https://i.ibb.co/jvn3LjNS/image1-1.png",
      "https://i.ibb.co/gBpPshp/screencapture-xstore-jet-vercel-app-2025-11-06-18-13-57.png",
      "https://i.ibb.co/dJky5zY0/screencapture-xstore-jet-vercel-app-about-us-2025-11-06-18-14-11.png",
      "https://i.ibb.co/Fb6Shbst/screencapture-xstore-jet-vercel-app-shop-2025-11-06-18-14-25.png",
      "https://i.ibb.co/gbmDdgCp/screencapture-xstore-jet-vercel-app-faqs-2025-11-06-18-14-34.png",
      "https://i.ibb.co/0VcJyYzS/screencapture-xstore-jet-vercel-app-contacts-2025-11-06-18-14-40.png"
    ]
  },
  {
    "id": 2,
    "title": "DinisoftBD - Web Hosting Company Website",
    "desc": "A modern and responsive web hosting company website built with Next.js and Tailwind CSS.",
    "img": "https://i.ibb.co/CsbXmbNB/project1-1.png",
    "type": "nextjs",
    "technologies": ["Next.js", "Tailwind CSS", "Lucide Icons", "Swiper.js"],
    "liveUrl": "https://dinisoftbd.com/",
    "githubUrl": "Adityo-dev/dinisoftbd",
    "completionDate": "January 2025",
    "status": "Completed",
    "longDescription": "DinisoftBD is a professional web hosting company website that provides a sleek and modern interface for users to explore hosting plans, domain registration, and digital services. The site is built using Next.js for fast rendering and SEO optimization, while Tailwind CSS ensures a clean and scalable design. Swiper.js adds dynamic carousel sections for testimonials and hosting packages, and Lucide Icons enhance the visual aesthetics with a minimal and modern icon set.",
    "challenges": "Optimizing SEO and load time while maintaining a feature-rich homepage was a key challenge. I implemented Next.js Image Optimization and dynamic component imports to reduce initial load and improve user experience.",
    "results": "The final product achieved a fully responsive layout, under 1.1s average page load time, and excellent Lighthouse scores for performance and accessibility. Client satisfaction increased significantly due to improved usability and modern UI.",
    "images": [
      "https://i.ibb.co/CsbXmbNB/project1-1.png",
      "https://i.ibb.co/20NfkQKt/project1-2.png",
      "https://i.ibb.co/KxdCKD98/project1-3.png",
      "https://i.ibb.co/0xP0rVQ/project1-4.png",
      "https://i.ibb.co/0xP0rVQ/project1-5.png"
    ]
  }
]
